Revit 2024 API
BRepBuilderGeometryId Methods
The BRepBuilderGeometryId type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
InvalidGeometryId
 Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace